zephyrproject-rtos/hal_nxp/mcux/drivers/kinetis/fsl_slcd.h
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_SLCD_H_
#define _FSL_SLCD_H_

#include "fsl_common.h"

/*!
 * @addtogroup slcd
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief SLCD driver version 2.0.1. */
#define FSL_SLCD_DRIVER_VERSION (MAKE_VERSION(2, 0, 1))
/*@}*/

/*! @brief SLCD power supply option. */
typedef enum _slcd_power_supply_option
{
    kSLCD_InternalVll3UseChargePump =
        2U, /*!< VLL3 connected to VDD internally, charge pump is used to generate VLL1 and VLL2. */
    kSLCD_ExternalVll3UseResistorBiasNetwork =
        4U, /*!< VLL3 is driven externally and resistor bias network is used to generate VLL1 and VLL2. */
    kSLCD_ExteranlVll3UseChargePump =
        6U, /*!< VLL3 is driven externally and charge pump is used to generate VLL1 and VLL2. */
    kSLCD_InternalVll1UseChargePump =
        7U /*!< VIREG is connected to VLL1 internally and charge pump is used to generate VLL2 and VLL3. */
} slcd_power_supply_option_t;

/*! @brief SLCD regulated voltage trim parameter, be used to meet the desired contrast. */
typedef enum _slcd_regulated_voltage_trim
{
    kSLCD_RegulatedVolatgeTrim00 = 0U, /*!< Increase the voltage to 0.91 V. */
    kSLCD_RegulatedVolatgeTrim01,      /*!< Increase the voltage to 1.01 V. */
    kSLCD_RegulatedVolatgeTrim02,      /*!< Increase the voltage to 0.96 V. */
    kSLCD_RegulatedVolatgeTrim03,      /*!< Increase the voltage to 1.06 V. */
    kSLCD_RegulatedVolatgeTrim04,      /*!< Increase the voltage to 0.93 V. */
    kSLCD_RegulatedVolatgeTrim05,      /*!< Increase the voltage to 1.02 V. */
    kSLCD_RegulatedVolatgeTrim06,      /*!< Increase the voltage to 0.98 V. */
    kSLCD_RegulatedVolatgeTrim07,      /*!< Increase the voltage to 1.08 V. */
    kSLCD_RegulatedVolatgeTrim08,      /*!< Increase the voltage to 0.92 V. */
    kSLCD_RegulatedVolatgeTrim09,      /*!< Increase the voltage to 1.02 V. */
    kSLCD_RegulatedVolatgeTrim10,      /*!< Increase the voltage to 0.97 V. */
    kSLCD_RegulatedVolatgeTrim11,      /*!< Increase the voltage to 1.07 V. */
    kSLCD_RegulatedVolatgeTrim12,      /*!< Increase the voltage to 0.94 V. */
    kSLCD_RegulatedVolatgeTrim13,      /*!< Increase the voltage to 1.05 V. */
    kSLCD_RegulatedVolatgeTrim14,      /*!< Increase the voltage to 0.99 V. */
    kSLCD_RegulatedVolatgeTrim15       /*!< Increase the voltage to 1.09 V. */
} slcd_regulated_voltage_trim_t;

/*! @brief SLCD load adjust to handle different LCD glass capacitance or
 *  configure the LCD charge pump clock source.
 *  Adjust the LCD glass capacitance if resistor bias network is enabled:
 *  kSLCD_LowLoadOrFastestClkSrc - Low load (LCD glass capacitance 2000pF or lower.
 *                 LCD or GPIO function can be used on VLL1,VLL2,Vcap1 and Vcap2 pins)
 *  kSLCD_LowLoadOrIntermediateClkSrc - low load (LCD glass capacitance 2000pF or lower.
 *                 LCD or GPIO function can be used on VLL1,VLL2,Vcap1 and Vcap2 pins)
 *  kSLCD_HighLoadOrIntermediateClkSrc - high load (LCD glass capacitance 8000pF or lower.
 *                 LCD or GPIO function can be used on Vcap1 and Vcap2 pins)
 *  kSLCD_HighLoadOrSlowestClkSrc - high load (LCD glass capacitance 8000pF or lower
 *                 LCD or GPIO function can be used on Vcap1 and Vcap2 pins)
 *  Adjust clock for charge pump if charge pump is enabled:
 *  kSLCD_LowLoadOrFastestClkSrc - Fasten clock source (LCD glass capacitance
 *                 8000pF or 4000pF or lower if Fast Frame Rate is set)
 *  kSLCD_LowLoadOrIntermediateClkSrc - Intermediate clock source (LCD glass
 *                 capacitance 4000pF or 2000pF or lower if Fast Frame Rate is set)
 *  kSLCD_HighLoadOrIntermediateClkSrc - Intermediate clock source (LCD glass
 *                 capacitance 2000pF or 1000pF or lower if Fast Frame Rate is set)
 *  kSLCD_HighLoadOrSlowestClkSrc - slowest clock source (LCD glass capacitance
 *                 1000pF or 500pF or lower if Fast Frame Rate is set)
 */
typedef enum _slcd_load_adjust
{
    kSLCD_LowLoadOrFastestClkSrc = 0U,  /*!< Adjust in low load or selects fastest clock. */
    kSLCD_LowLoadOrIntermediateClkSrc,  /*!< Adjust in low load or selects intermediate clock. */
    kSLCD_HighLoadOrIntermediateClkSrc, /*!< Adjust in high load or selects intermediate clock. */
    kSLCD_HighLoadOrSlowestClkSrc       /*!< Adjust in high load or selects slowest clock. */
} slcd_load_adjust_t;

/*! @brief SLCD clock source. */
typedef enum _slcd_clock_src
{
    kSLCD_DefaultClk    = 0U, /*!< Select default clock ERCLK32K. */
    kSLCD_AlternateClk1 = 1U, /*!< Select alternate clock source 1 : MCGIRCLK. */
#if FSL_FEATURE_SLCD_HAS_MULTI_ALTERNATE_CLOCK_SOURCE
    kSLCD_AlternateClk2 = 3U /*!< Select alternate clock source 2 : OSCERCLK. */
#endif                       /* FSL_FEATURE_SLCD_HAS_MULTI_ALTERNATE_CLOCK_SOURCE */
} slcd_clock_src_t;

/*! @brief SLCD alternate clock divider. */
typedef enum _slcd_alt_clock_div
{
    kSLCD_AltClkDivFactor1 = 0U, /*!< No divide for alternate clock. */
    kSLCD_AltClkDivFactor64,     /*!< Divide alternate clock with factor 64. */
    kSLCD_AltClkDivFactor256,    /*!< Divide alternate clock with factor 256. */
    kSLCD_AltClkDivFactor512     /*!< Divide alternate clock with factor 512. */
} slcd_alt_clock_div_t;

/*! @brief SLCD clock prescaler to generate frame frequency. */
typedef enum _slcd_clock_prescaler
{
    kSLCD_ClkPrescaler00 = 0U, /*!< Prescaler 0. */
    kSLCD_ClkPrescaler01,      /*!< Prescaler 1. */
    kSLCD_ClkPrescaler02,      /*!< Prescaler 2. */
    kSLCD_ClkPrescaler03,      /*!< Prescaler 3. */
    kSLCD_ClkPrescaler04,      /*!< Prescaler 4. */
    kSLCD_ClkPrescaler05,      /*!< Prescaler 5. */
    kSLCD_ClkPrescaler06,      /*!< Prescaler 6. */
    kSLCD_ClkPrescaler07       /*!< Prescaler 7. */
} slcd_clock_prescaler_t;

/*! @brief SLCD duty cycle. */
typedef enum _slcd_duty_cycle
{
    kSLCD_1Div1DutyCycle = 0U, /*!< LCD use 1 BP 1/1 duty cycle. */
    kSLCD_1Div2DutyCycle,      /*!< LCD use 2 BP 1/2 duty cycle. */
    kSLCD_1Div3DutyCycle,      /*!< LCD use 3 BP 1/3 duty cycle. */
    kSLCD_1Div4DutyCycle,      /*!< LCD use 4 BP 1/4 duty cycle. */
    kSLCD_1Div5DutyCycle,      /*!< LCD use 5 BP 1/5 duty cycle. */
    kSLCD_1Div6DutyCycle,      /*!< LCD use 6 BP 1/6 duty cycle. */
    kSLCD_1Div7DutyCycle,      /*!< LCD use 7 BP 1/7 duty cycle. */
    kSLCD_1Div8DutyCycle       /*!< LCD use 8 BP 1/8 duty cycle. */
} slcd_duty_cycle_t;

/*! @brief SLCD segment phase type. */
typedef enum _slcd_phase_type
{
    kSLCD_NoPhaseActivate = 0x00U, /*!< LCD wareform no phase activates. */
    kSLCD_PhaseAActivate  = 0x01U, /*!< LCD waveform phase A activates. */
    kSLCD_PhaseBActivate  = 0x02U, /*!< LCD waveform phase B activates. */
    kSLCD_PhaseCActivate  = 0x04U, /*!< LCD waveform phase C activates. */
    kSLCD_PhaseDActivate  = 0x08U, /*!< LCD waveform phase D activates. */
    kSLCD_PhaseEActivate  = 0x10U, /*!< LCD waveform phase E activates. */
    kSLCD_PhaseFActivate  = 0x20U, /*!< LCD waveform phase F activates. */
    kSLCD_PhaseGActivate  = 0x40U, /*!< LCD waveform phase G activates. */
    kSLCD_PhaseHActivate  = 0x80U  /*!< LCD waveform phase H activates. */
} slcd_phase_type_t;

/*! @brief SLCD segment phase bit index. */
typedef enum _slcd_phase_index
{
    kSLCD_PhaseAIndex = 0x0U, /*!< LCD phase A bit index. */
    kSLCD_PhaseBIndex = 0x1U, /*!< LCD phase B bit index. */
    kSLCD_PhaseCIndex = 0x2U, /*!< LCD phase C bit index. */
    kSLCD_PhaseDIndex = 0x3U, /*!< LCD phase D bit index. */
    kSLCD_PhaseEIndex = 0x4U, /*!< LCD phase E bit index. */
    kSLCD_PhaseFIndex = 0x5U, /*!< LCD phase F bit index. */
    kSLCD_PhaseGIndex = 0x6U, /*!< LCD phase G bit index. */
    kSLCD_PhaseHIndex = 0x7U  /*!< LCD phase H bit index. */
} slcd_phase_index_t;

/*! @brief SLCD display mode. */
typedef enum _slcd_display_mode
{
    kSLCD_NormalMode = 0U, /*!< LCD Normal display mode. */
    kSLCD_AlternateMode,   /*!< LCD Alternate display mode. For four back planes or less. */
    kSLCD_BlankMode        /*!< LCD Blank display mode. */
} slcd_display_mode_t;

/*! @brief SLCD blink mode. */
typedef enum _slcd_blink_mode
{
    kSLCD_BlankDisplayBlink = 0U, /*!< Display blank during the blink period. */
    kSLCD_AltDisplayBlink /*!< Display alternate display during the blink period if duty cycle is lower than 5. */
} slcd_blink_mode_t;

