zephyrproject-rtos/hal_nxp/mcux/drivers/kinetis/fsl_slcd.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus*/

/*!
 * @name Initialization and deinitialization
 * @{
 */

/*!
 * @brief Initializes the SLCD, ungates the module clock, initializes the power
 * setting, enables all used plane pins, and sets with interrupt and work mode
 * with the configuration.
 *
 * @param base  SLCD peripheral base address.
 * @param configure SLCD configuration pointer.
 *   For the configuration structure, many parameters have the default setting
 *   and the SLCD_Getdefaultconfig() is provided to get them. Use it
 *   verified for their applications.
 *   The others have no default settings, such as "clkConfig", and must be provided
 *   by the application before calling the SLCD_Init() API.
 */
void SLCD_Init(LCD_Type *base, slcd_config_t *configure);

/*!
 * @brief Deinitializes the SLCD module, gates the module clock, disables an interrupt,
 * and displays the SLCD.
 *
 * @param base  SLCD peripheral base address.
 */
void SLCD_Deinit(LCD_Type *base);

/*!
 * @brief Gets the SLCD default configuration structure. The
 * purpose of this API is to get default parameters of the configuration structure
 * for the SLCD_Init(). Use these initialized parameters unchanged in SLCD_Init()
 * or modify fields of the structure before the calling SLCD_Init().
 * All default parameters of the configure structuration are listed.
 * @code
   config.displayMode        = kSLCD_NormalMode; // SLCD normal mode
   config.powerSupply        = kSLCD_InternalVll3UseChargePump;  // Use charge pump internal VLL3
   config.voltageTrim        = kSLCD_RegulatedVolatgeTrim00;
   config.lowPowerBehavior   = kSLCD_EnabledInWaitStop;  // Work on low power mode
   config.interruptSrc       = 0;                // No interrupt source is enabled
   config.faultConfig        = NULL;             // Fault detection is disabled
   config.frameFreqIntEnable =  false;
   @endcode
 * @param configure The SLCD configuration structure pointer.
 */
void SLCD_GetDefaultConfig(slcd_config_t *configure);

/* @}*/

/*!
 * @name Plane Setting and Display Control
 * @{
 */

/*!
 * @brief Enables the SLCD controller, starts generation, and displays the front plane and back plane waveform.
 *
 * @param base  SLCD peripheral base address.
 */
static inline void SLCD_StartDisplay(LCD_Type *base)
{
    base->GCR |= LCD_GCR_LCDEN_MASK;
}

/*!
 * @brief Stops the SLCD controller. There is no waveform generator and all enabled pins
 * only output a low value.
 *
 * @param base  SLCD peripheral base address.
 */
static inline void SLCD_StopDisplay(LCD_Type *base)
{
    base->GCR &= ~LCD_GCR_LCDEN_MASK;
}

/*!
 * @brief Starts the SLCD blink mode.
 *
 * @param base  SLCD peripheral base address.
 * @param mode  SLCD blink mode.
 * @param rate  SLCD blink rate.
 */
void SLCD_StartBlinkMode(LCD_Type *base, slcd_blink_mode_t mode, slcd_blink_rate_t rate);

/*!
 * @brief Stops the SLCD blink mode.
 *
 * @param base  SLCD peripheral base address.
 */
static inline void SLCD_StopBlinkMode(LCD_Type *base)
{
    base->AR &= ~LCD_AR_BLINK_MASK;
}

/*!
 * @brief Sets the SLCD back plane pin phase.
 *
 * This function sets the SLCD back plane pin phase. "kSLCD_PhaseXActivate" setting
 * means the phase X is active for the back plane pin. "kSLCD_NoPhaseActivate" setting
 * means there is no phase active for the back plane pin.
 * For example, set the back plane pin 20 for phase A.
 * @code
 * SLCD_SetBackPlanePhase(LCD, 20, kSLCD_PhaseAActivate);
 * @endcode
 *
 * @param base    SLCD peripheral base address.
 * @param pinIndx SLCD back plane pin index. Range from 0 to 63.
 * @param phase   The phase activates for the back plane pin.
 */
static inline void SLCD_SetBackPlanePhase(LCD_Type *base, uint32_t pinIndx, slcd_phase_type_t phase)
{
    base->WF8B[pinIndx] = phase;
}

/*!
 * @brief Sets the SLCD front plane segment operation for a front plane pin.
 *
 * This function sets the SLCD front plane segment on or off operation.
 * Each bit turns on or off the segments associated with the front plane pin in
 * the following pattern: HGFEDCBA (most significant bit controls segment H and
 * least significant bit controls segment A).
 * For example, turn on the front plane pin 20 for phase B and phase C.
 * @code
 * SLCD_SetFrontPlaneSegments(LCD, 20, (kSLCD_PhaseBActivate | kSLCD_PhaseCActivate));
 * @endcode
 *
 * @param base      SLCD peripheral base address.
 * @param pinIndx   SLCD back plane pin index. Range from 0 to 63.
 * @param operation The operation for the segment on the front plane pin.
 *                  This is a logical OR of the enumeration :: slcd_phase_type_t.
 */
static inline void SLCD_SetFrontPlaneSegments(LCD_Type *base, uint32_t pinIndx, uint8_t operation)
{
    base->WF8B[pinIndx] = operation;
}

/*!
 * @brief Sets one SLCD front plane pin for one phase.
 *
 * This function can be used to set one phase on or off for the front plane pin.
 * It can be call many times to set the plane pin for different phase indexes.
 * For example, turn on the front plane pin 20 for phase B and phase C.
 * @code
 * SLCD_SetFrontPlaneOnePhase(LCD, 20, kSLCD_PhaseBIndex, true);
 * SLCD_SetFrontPlaneOnePhase(LCD, 20, kSLCD_PhaseCIndex, true);
 * @endcode
 *
 * @param base      SLCD peripheral base address.
 * @param pinIndx   SLCD back plane pin index. Range from 0 to 63.
 * @param phaseIndx The phase bit index @ref slcd_phase_index_t.
 * @param enable    True to turn on the segment for phaseIndx phase
 *                  false to turn off the segment for phaseIndx phase.
 */
static inline void SLCD_SetFrontPlaneOnePhase(LCD_Type *base,
                                              uint32_t pinIndx,
                                              slcd_phase_index_t phaseIndx,
                                              bool enable)
{
    uint8_t reg = base->WF8B[pinIndx];

    if (enable)
    {
        base->WF8B[pinIndx] = (reg | (1U << phaseIndx));
    }
    else
    {
        base->WF8B[pinIndx] = (reg & ~(1U << phaseIndx));
    }
}

#if FSL_FEATURE_SLCD_HAS_PAD_SAFE
/*!
 * @brief Enables/disables the SLCD pad safe state.
 *
 * Forces the safe state on the LCD pad controls. All LCD front plane
 * and backplane functions are disabled.
 *
 * @param base  SLCD peripheral base address.
 * @param enable True enable, false disable.
 */
static inline void SLCD_EnablePadSafeState(LCD_Type *base, bool enable)
{
    if (enable)
    { /* Enable. */
        base->GCR |= LCD_GCR_PADSAFE_MASK;
    }
    else
    { /* Disable. */
        base->GCR &= ~LCD_GCR_PADSAFE_MASK;
    }
}
#endif /* FSL_FEATURE_SLCD_HAS_PAD_SAFE */

/*!
 * @brief Gets the SLCD fault detect counter.
 *
 * This function gets the number of samples inside the
 * fault detection sample window.
 *
 * @param base  SLCD peripheral base address.
 * @return The fault detect counter. The maximum return value is 255.
 * If the maximum 255 returns, the overflow may happen.
 * Reconfigure the fault detect sample window and fault detect clock prescaler
 * for proper sampling.
 */
static inline uint32_t SLCD_GetFaultDetectCounter(LCD_Type *base)
{
    return base->FDSR & LCD_FDSR_FDCNT_MASK;
}

/* @} */

/*!
 * @name Interrupts.
 * @{
 */

/*!
 * @brief Enables the SLCD interrupt.
 * For example, to enable fault detect complete interrupt and frame frequency interrupt,
 * for FSL_FEATURE_SLCD_HAS_FRAME_FREQUENCY_INTERRUPT enabled case, do the following.
 * @code
 *     SLCD_EnableInterrupts(LCD,kSLCD_FaultDetectCompleteInterrupt | kSLCD_FrameFreqInterrupt);
 * @endcode
 *
 * @param base  SLCD peripheral base address.
 * @param mask  SLCD interrupts to enable. This is a logical OR of the
 *             enumeration :: slcd_interrupt_enable_t.
 */
void SLCD_EnableInterrupts(LCD_Type *base, uint32_t mask);

/*!
 * @brief Disables the SLCD interrupt.
 * For example, to disable fault detect complete interrupt and frame frequency interrupt,
 * for FSL_FEATURE_SLCD_HAS_FRAME_FREQUENCY_INTERRUPT enabled case, do the following.
 * @code
 *     SLCD_DisableInterrupts(LCD,kSLCD_FaultDetectCompleteInterrupt | kSLCD_FrameFreqInterrupt);
 * @endcode
 *
 * @param base  SLCD peripheral base address.
 * @param mask  SLCD interrupts to disable. This is a logical OR of the
 *             enumeration :: slcd_interrupt_enable_t.
 */
void SLCD_DisableInterrupts(LCD_Type *base, uint32_t mask);

/*!
 * @brief Gets the SLCD interrupt status flag.
 *
 * @param base  SLCD peripheral base address.
 * @return The event status of the interrupt source. This is the logical OR of members
 *         of the enumeration :: slcd_interrupt_enable_t.
 */
uint32_t SLCD_GetInterruptStatus(LCD_Type *base);

/*!
 * @brief Clears the SLCD interrupt events status flag.
 *
 * @param base  SLCD peripheral base address.
 * @param mask  SLCD interrupt source to be cleared.
 * This is the logical OR of members of the enumeration :: slcd_interrupt_enable_t.
 */
void SLCD_ClearInterruptStatus(LCD_Type *base, uint32_t mask);

/* @} */

#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/

#endif /* _FSL_SLCD_H_*/
